Clown-is-me/Target-Game-STM32/COM-device/Core/Inc/main.h
/* USER CODE BEGIN Header */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */
/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LEFT_BUTTON_Pin GPIO_PIN_1
#define LEFT_BUTTON_GPIO_Port GPIOA
#define LEFT_BUTTON_EXTI_IRQn EXTI1_IRQn
#define hdma_usart2_tx_Pin GPIO_PIN_2
#define hdma_usart2_tx_GPIO_Port GPIOA
#define hdma_usart2_rx_Pin GPIO_PIN_3
#define hdma_usart2_rx_GPIO_Port GPIOA
#define MIDDLE_BUTTON_Pin GPIO_PIN_4
#define MIDDLE_BUTTON_GPIO_Port GPIOA
#define MIDDLE_BUTTON_EXTI_IRQn EXTI4_IRQn
#define RIGHT_BUTTON_Pin GPIO_PIN_0
#define RIGHT_BUTTON_GPIO_Port GPIOB
#define RIGHT_BUTTON_EXTI_IRQn EXTI0_IRQn
#define SHIFT_CLOCK_Pin GPIO_PIN_8
#define SHIFT_CLOCK_GPIO_Port GPIOA
#define SEG_DATA_Pin GPIO_PIN_9
#define SEG_DATA_GPIO_Port GPIOA
#define BUZZER_Pin GPIO_PIN_3
#define BUZZER_GPIO_Port GPIOB
#define SHIFT_LATCH_Pin GPIO_PIN_5
#define SHIFT_LATCH_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
